#include <stdio.h>
#include <Windows.h>
#include <conio.h>
#include <iostream>
using namespace std;
int main() {

	setlocale(LC_ALL, "ru");
repit:	//ссылка если введён неправльный номер варианта
	int a;
	cout << "1. Прайс-лист\n" 
		<< "2. Фирмы\n" 
		<< "3. Отдел кадров\n" 
		<< "4. Ведомость деталей\n" 
		<< "5. Характеристики ПЭВМ\n" 
		<< "6. Ведомость комплектующих\n" 
		<< "7. Офисные пакеты\n" 
		<< "8. Ведомость общественного транспорт\n" 
		<< "9. Приблизительное количество звезд разных спектральных классов в Галактике\n" 
		<< "10. Время выполнения некоторых программ, которые применяют параллельные алгоритмы\n" 
		<< "11. Коэффициенты теплопроводимости материалов\n" 
		<< "12. Сельскохозяйственные культуры\n" 
		<< "13. Ведомости о присвоении квалификации\n" 
		<< "14. Журнал регистрации аварий:\n\n"
		<< "Введите номер варианта: ";

	cin >> a;
	cout << endl;

	//--------------------------------------------//	1	ПЕРВЫЙ ВАРИАНТ		//-----------------------------------------------------------------//

	if (a == 1) {										
		cout << "Вы выбрали 1 вариант ПРАЙС-ЛИСТ\n";
		cout << "Примечание категории товара К-компьютеры, С-комплектующие, М-множительная техника\n\n";
		cout << "Введите кол-во продуктов: ";
		int sizeC;
		float Sum = 0;
		int sumD = 0;
		int Days=0;
		cin >> sizeC;
		cout << endl;
		int* arNom = new int[sizeC] {};
		char* arKat = new char[sizeC] {};
		float* arCen = new float[sizeC] {};
		int* arSro = new int[sizeC] {};
		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите номер "<<i+1<<" товара: "; cin >> arNom[i];
			cout << "\nВведите категорию " << i + 1 << " товара: "; cin >> arKat[i];
			cout << "\nВведите цену " << i + 1 << " товара: "; cin >> arCen[i];
			cout << "\nВведите срок поставки " << i + 1 << " товара: "; cin >> arSro[i]; cout << endl << endl;
			Sum += arCen[i];
			sumD += arSro[i];
		}
		Days = sumD / sizeC;
		cout << "-------------------------------------------------------------------------\n";
		cout << "|Прайс-лист                                                             |\n";
		cout << "|-----------------------------------------------------------------------|\n";
		cout << "|  Номер товара   |   Категория     |   Цена(руб)     |Срок поставки(дн)|\n";
		cout << "|-----------------|-----------------|-----------------|-----------------|\n";
		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-17d|%-17c|%-17f|%-17.1d|\n", arNom[i], arKat[i], arCen[i], arSro[i]);
		}
		cout << "|------------------|-----------------|-----------------|----------------|\n";
		printf_s("|   Общая цена    |                 |%-17.1f|                 |\n", Sum);
		cout << "|------------------|-----------------|-----------------|----------------|\n";
		printf_s("|  Средний срок   |                 |                 |%-17d|\n", Days);
		cout << "|-----------------------------------------------------------------------|\n";
		cout << "|Примечание категории товара К-компьютеры, С-комплектующие,             |\n";
		cout << "|М - множительная техника                                               |\n";
		cout << "-------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	2	ВТОРОЙ ВАРИАНТ		//-----------------------------------------------------------------//
	
	if (a == 2) {											
		cout << "Вы выбрали 2 вариант ФИРМЫ\n\n";
		cout << "Введите кол-во фирм: ";

		int sizeC;
		float SumCha = 0;
		float SumObe = 0;
		int SumKol = 0;
		cin >> sizeC;
		cout << endl;

		int* arNom = new int[sizeC] {};
		int* arKol = new int[sizeC] {};
		float* arObe = new float[sizeC] {};
		float* arCha = new float[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите номер " << i + 1 << " фирмы: "; cin >> arNom[i];
			cout << "\nВведите кол-во " << i + 1 << " продуктов: "; cin >> arKol[i];
			cout << "\nВведите обёъм продажи (млн. $) " << i + 1 << " фирмы: "; cin >> arObe[i];
			cout << "\nВведите часть рынка (%) " << i + 1 << " фирмы: "; cin >> arCha[i]; cout << endl << endl;
			SumKol += arKol[i];
			SumObe += arObe[i];
			SumCha += arCha[i];
		}

		cout << "-----------------------------------------------------------------------------\n";
		cout << "|Фирмы                                                                      |\n";
		cout << "|---------------------------------------------------------------------------|\n";
		cout << "|   Номер фирмы    | Кол-во продуктов |Объм продаж(млн.$)|  Часть рынка(%)  |\n";
		cout << "|------------------|------------------|------------------|------------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-18d|%-18d|%-18.2f|%-18.1f|\n", arNom[i], arKol[i], arObe[i], arCha[i]);

		}

		cout << "|-------------------|------------------|------------------|-----------------|\n";
	   printf_s("|Общее кол-во прод.|%-18d|                  |                  |\n", SumKol);
		cout << "|-------------------|------------------|------------------|-----------------|\n";
	   printf_s("|Общий объём продаж|                  |%-18.2f|                  |\n", SumObe);
		cout << "|-------------------|------------------|------------------|-----------------|\n";
	   printf_s("|Сумм. часть рынка |                  |                  |%-18.1f|\n", SumCha);
		cout << "-----------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	3	ТРЕТЬИЙ ВАРИАНТ		//-----------------------------------------------------------------//

	if (a == 3) {											
		cout << "Вы выбрали 3 вариант ОТДЕЛ КАДРОВ\n\n";
		cout << "Введите кол-во сотрудников: ";

		int sizeC;
		int SumAge = 0;
		int SrSumAge = 0;
		float SumOkl = 0;
		float SrSumOkl = 0;
		cin >> sizeC;
		cout << endl;

		cout << "Примечание: М-менеджер, С-секретарь, И-инжинер\n";
		int* arNom = new int[sizeC] {};
		char* arDol = new char[sizeC] {};
		int* arAge = new int[sizeC] {};
		float* arOkl = new float[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите номер " << i + 1 << " сотрудника: "; cin >> arNom[i];
			cout << "\nВведите должность " << i + 1 << " сотрудника: "; cin >> arDol[i];
			cout << "\nВведите возвраст " << i + 1 << " сотрудника: "; cin >> arAge[i];
			cout << "\nВведите оклад (тыс. руб.) " << i + 1 << " сотрудника: "; cin >> arOkl[i]; cout << endl << endl;
			SumAge += arAge[i];
			SumOkl += arOkl[i];
		}

		SrSumAge = SumAge / sizeC;
		SrSumOkl = SumOkl / sizeC;

		cout << "-------------------------------------------------------------------------\n";
		cout << "|Отдел кадров                                                           |\n";
		cout << "|-----------------------------------------------------------------------|\n";
		cout << "|Номер сотрудника |    Должность    |  Возвраст (лет) |Оклад (тыс. руб.)|\n";
		cout << "|-----------------|-----------------|-----------------|-----------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-17d|%-17c|%-17d|%-17.2f|\n", arNom[i], arDol[i], arAge[i], arOkl[i]);

		}

		cout << "|-----------------|-----------------|-----------------|-----------------|\n";
		printf_s("|Средний возвраст |                 |%-17d|                 |\n", SrSumAge);
		cout << "|-----------------|-----------------|-----------------|-----------------|\n";
		printf_s("|  Средний оклад  |                 |                 |%-17.2f|\n", SrSumOkl);
		cout << "|-----------------------------------------------------------------------|\n";
		cout << "|Примечание: М-менеджер, С-секретарь, И-инжинер                         |\n";
		cout << "-------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	4	ЧЕТВЁРТЫЙ ВАРИАНТ	//-----------------------------------------------------------------//

	if (a == 4) {											
		cout << "Вы выбрали 4 вариант ВЕДОМОСТЬ ДЕТАЛЕЙ\n\n";
		cout << "Введите кол-во деталей: ";

		int sizeC;
		int SumKol = 0;
		cin >> sizeC;
		cout << endl;

		cout << "Примечание: О-оригинальная, П-покупная, З-заимственная\n";
		int* arNom = new int[sizeC] {};
		char* arType = new char[sizeC] {};
		int* arKol = new int[sizeC] {};
		int* arVes = new int[sizeC] {};
		int* arVesAll = new int[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите номер " << i + 1 << " детали: "; cin >> arNom[i];
			cout << "\nВведите тип " << i + 1 << " детали: "; cin >> arType[i];
			cout << "\nВведите кол-во " << i + 1 << " деталей: "; cin >> arKol[i];
			cout << "\nВведите вес одной детали (г): "; cin >> arVes[i];
			cout << "\nВведите общий вес (г)" << i + 1 << " деталей: "; cin >> arVesAll[i]; cout << endl << endl;
			SumKol += arKol[i];
		}

		cout << "--------------------------------------------------------------------------------------\n";
		cout << "|Ведомость деталей                                                                   |\n";
		cout << "|------------------------------------------------------------------------------------|\n";
		cout << "|  Номер детали  |       Тип      |   Количество   |Вес 1 детали (г)| Общий вес (г)  |\n";
		cout << "|----------------|----------------|----------------|----------------|----------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-16d|%-16c|%-16d|%-16d|%-16d|\n", arNom[i], arType[i], arKol[i], arVes[i], arVesAll[i]);

		}

		cout << "|----------------|----------------|----------------|----------------|----------------|\n";
	   printf_s("|  Общее кол-во  |                |%-16d|                |                |\n", SumKol);
		cout << "|------------------------------------------------------------------------------------|\n";
		cout << "|Примечание: О-оригинальная, П-покупная, З-заимственная                              |\n";
		cout << "--------------------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	5	ПЯТЫЙ ВАРИАНТ		//-----------------------------------------------------------------//

	if (a == 5) {											
		cout << "Вы выбрали 5 вариант ХАРАКТЕРИСТКИ ПЭВМ\n\n";
		cout << "Введите кол-во ПЭВМ: ";

		int sizeC;
		int SumCha = 0;
		int SrSumCha = 0;
		float SumRam = 0;
		float SrSumRam = 0;
		cin >> sizeC;
		cout << endl;

		cout << "Примечание: Тип С-CISC процессор, R-RISC процессор\n";
		int* arNom = new int[sizeC] {};
		int* arCha = new int[sizeC] {};
		float* arRam = new float[sizeC] {};
		char* arType = new char[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите код " << i + 1 << " процессора: "; cin >> arNom[i];
			cout << "\nВведите частоту (Mgz) " << i + 1 << " процессора: "; cin >> arCha[i];
			cout << "\nВведите объём RAM " << i + 1 << " памяти: "; cin >> arRam[i];
			cout << "\nВведите тип " << i + 1 << " процессора: "; cin >> arType[i]; cout << endl << endl;
			SumCha += arCha[i];
			SumRam += arRam[i];
		}

		SrSumCha = SumCha / sizeC;
		SrSumRam = SumRam / sizeC;

		cout << "-------------------------------------------------------------\n";
		cout << "|Характеристики ПЭВМ                                        |\n";
		cout << "|-----------------------------------------------------------|\n";
		cout << "|Код процессора|Частота (Mgz) |   RAM (Gb)   |     Тип      |\n";
		cout << "|--------------|--------------|--------------|--------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-14d|%-14d|%-14.1f|%-14c|\n", arNom[i], arCha[i], arRam[i], arType[i]);

		}

		cout << "|--------------|--------------|--------------|--------------|\n";
		printf_s("| Ср. частота  |%-14d|              |              |\n", SrSumCha);
		cout << "|--------------|--------------|--------------|--------------|\n";
		printf_s("|Ср. объём RAM |              |%-14.1f|              |\n", SrSumRam);
		cout << "|-----------------------------------------------------------|\n";
		cout << "|Тип С-CISC процессор, R-RISC порцессор                     |\n";
		cout << "-------------------------------------------------------------\n";
	}

	//--------------------------------------------//	6	ШЕСТОЙ ВАРИАНТ		//-----------------------------------------------------------------//

	if (a == 6) {
		cout << "Вы выбрали 6 вариант ВЕДОМОСТЬ КОМПЛЕКТУЮЩИХ\n\n";
		cout << "Введите кол-во типов комплектующих: ";

		int sizeC;
		int SumKol = 0;
		int SumVes = 0;
		int SrSumVes = 0;
		cin >> sizeC;
		cout << endl;

		cout << "Примечание: R-резистор,C-конденсатор\n";
		int* arKod = new int[sizeC] {};
		char* arType = new char[sizeC] {};
		float* arNom = new float[sizeC] {};
		int* arKol = new int[sizeC] {};
		int* arVes = new int[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите код " << i + 1 << " комплектующего: "; cin >> arKod[i];
			cout << "\nВведите тип " << i + 1 << " комплектующего: "; cin >> arType[i];
			cout << "\nВведите номинал " << i + 1 << " комплектующего: "; cin >> arNom[i];
			cout << "\nВведите количество " << i + 1 << " комплектующих: "; cin >> arKol[i];
			cout << "\nВведите вес " << i + 1 << " комплектующего: "; cin >> arVes[i]; cout << endl << endl;
			SumVes += arVes[i];
			SumKol += arKol[i];
		}

		SrSumVes = SumVes / sizeC;

		cout << "--------------------------------------------------------\n";
		cout << "|Ведомость комплектующих                               |\n";
		cout << "|------------------------------------------------------|\n";
		cout << "|   Код    |   Тип    | Номинал  |Количество| Вес (г)  |\n";
		cout << "|----------|----------|----------|----------|----------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-10d|%-10c|%-10.1f|%-10d|%-10d|\n", arKod[i], arType[i], arNom[i], arKol[i], arVes[i]);

		}

		cout << "|----------|----------|----------|----------|----------|\n";
		printf_s("|Об. кол-во|          |          |%-10d|          |\n", SumKol);
		cout << "|----------|----------|----------|----------|----------|\n";
		printf_s("| Ср. вес  |          |          |          |%-10d|\n", SrSumVes);
		cout << "|------------------------------------------------------|\n";
		cout << "|Примечание: R-резистор, C-конденсатор                 |\n";
		cout << "--------------------------------------------------------\n";
	}

	//--------------------------------------------//	7	СЕДЬМОЙ ВАРИАНТ		//-----------------------------------------------------------------//

	if (a == 7) {
		cout << "Вы выбрали 7 вариант ОФИСНЫЕ ПАКЕТЫ\n\n";
		cout << "Введите кол-во типов пакетов: ";

		int sizeC;
		int SumKol = 0;
		int SumCen = 0;
		int SrSumKol = 0;
		float SrSumCen = 0;
		cin >> sizeC;
		cout << endl;

		cout << "Примечание: M-Microsoft, L-Lotus, S-Sun\n";
		int* arNom = new int[sizeC] {};
		char* arPro = new char[sizeC] {};
		int* arKol = new int[sizeC] {};
		float* arCen = new float[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите номер " << i + 1 << " пакета: "; cin >> arNom[i];
			cout << "\nВведите производителя " << i + 1 << " пакета: "; cin >> arPro[i];
			cout << "\nВведите кол-во сост.частей " << i + 1 << " пакета: "; cin >> arKol[i];
			cout << "\nВведите цену ($): " << i + 1 << " пакета: "; cin >> arCen[i]; cout << endl << endl;
			
			SumKol += arKol[i];
			SumCen += arCen[i];
		}

		SrSumKol = SumKol / sizeC;
		SrSumCen = SumCen / sizeC;


		cout << "---------------------------------------------------------------\n";
		cout << "|Офисные пакеты                                               |\n";
		cout << "|-------------------------------------------------------------|\n";
		cout << "|  Номер   |  Производитель  |Кол-во сост. частей|  Цена ($)  |\n";
		cout << "|----------|-----------------|-------------------|------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-10d|%-17c|%-19d|%-12.1f|\n", arNom[i], arPro[i], arKol[i], arCen[i]);

		}

		cout << "|----------|-----------------|-------------------|------------|\n";
	   printf_s("|Cр. кол-во|                 |%-19d|            |\n", SrSumKol);
		cout << "|----------|-----------------|-------------------|------------|\n";
	   printf_s("| Ср. цена |                 |                   |%-12.1f|\n", SrSumCen);
		cout << "|-------------------------------------------------------------|\n";
		cout << "|Примечание: M-Microsoft, L-Lotus, S-Sun                      |\n";
		cout << "---------------------------------------------------------------\n";
	}

	//--------------------------------------------//	8	ВОСЬМОЙ ВАРИАНТ		//-----------------------------------------------------------------//

	if (a == 8) {
		cout << "Вы выбрали 8 вариант ВЕДОМОСТЬ ОБЩЕСТВЕННОГО ТРАНСПОРТА\n\n";
		cout << "Введите кол-во типов т/с: ";

		int sizeC;
		float SumPro = 0;
		int SumTime = 0;
		int SrSumTime = 0;
		cin >> sizeC;
		cout << endl;

		cout << "Примечание: T-трамвай, M-маршрутное такси, A-автобус\n";
		char* arType = new char[sizeC] {};
		int* arMar = new int[sizeC] {};
		float* arPro = new float[sizeC] {};
		int* arTime = new int[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите вид " << i + 1 << " т/с: "; cin >> arType[i];
			cout << "\nВведите № маршрута " << i + 1 << " т/с: "; cin >> arMar[i];
			cout << "\nВведите протяженность маршрута (км) " << i + 1 << " т/с: "; cin >> arPro[i];
			cout << "\nВведите время в дороге (мин): " << i + 1 << " т/с: "; cin >> arTime[i]; cout << endl << endl;

			SumPro += arPro[i];
			SumTime += arTime[i];
		}

		SrSumTime = SumTime / sizeC;


		cout << "---------------------------------------------------------------------------------------------\n";
		cout << "|Ведомость общественного транспорта                                                         |\n";
		cout << "|-------------------------------------------------------------------------------------------|\n";
		cout << "|    Вид транспорта    |      № маршрута      |Протяженность маршрута| Время в дороге (мин) |\n";
		cout << "|----------------------|----------------------|----------------------|----------------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-22c|%-22d|%-22f|%-22d|\n", arType[i], arMar[i], arPro[i], arTime[i]);

		}

		cout << "|----------------------|----------------------|----------------------|----------------------|\n";
	   printf_s("| Общая протяженность  |                      |%-22.1f|                      |\n", SumPro);
		cout << "|----------------------|----------------------|----------------------|----------------------|\n";
	   printf_s("|    Среднее время     |                      |                      |%-22d|\n", SrSumTime);
		cout << "|-------------------------------------------------------------------------------------------|\n";
		cout << "|Примечание: T-трамвай, M-маршрутное такси, A-автобус                                       |\n";
		cout << "---------------------------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	9	ДЕВЯТЫЙ ВАРИАНТ		//-----------------------------------------------------------------//

	if (a == 9) {
		cout << "Вы выбрали 9 вариант ПРИБЛИЗИТЕЛЬНОЕ КОЛ-ВО ЗВЁЗД РАЗНЫХ СПЕКТРАЛЬНЫХ КЛАССОВ В ГАЛАКТИКЕ\n\n";
		cout << "Введите кол-во звёзд: ";

		int sizeC;
		float SumVes = 0;
		float SumKol = 0;
		float SrSumVes = 0;
		float SrSumKol = 0;
		cin >> sizeC;
		cout << endl;

		char* arType = new char[sizeC] {};
		float* arVes = new float[sizeC] {};
		float* arCha = new float[sizeC] {};
		float* arKol = new float[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите спектральный класс " << i + 1 << " звезды: "; cin >> arType[i];
			cout << "\nВведите приблизительную массу (отн. Солнца) " << i + 1 << " звезды: "; cin >> arVes[i];
			cout << "\nВведите часть % " << i + 1 << " звезды: "; cin >> arCha[i];
			cout << "\nВведите числиность (млн) " << i + 1 << " звезды: "; cin >> arKol[i]; cout << endl << endl;

			SumVes += arVes[i];
			SumKol += arKol[i];
		}

		SrSumVes = SumVes / sizeC;
		SrSumKol = SumKol / sizeC;

		cout << "---------------------------------------------------------------------------------------------\n";
		cout << "|Приблизительное количество звёзд разныых спектральныз классов в Галактике                  |\n";
		cout << "|-------------------------------------------------------------------------------------------|\n";
		cout << "| Спектральный класс  | Приблизительная масса (отн. Солнца)  | Часть %  | Численость (млн)  |\n";
		cout << "|---------------------|--------------------------------------|----------|-------------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-21c|%-38.2f|%-10.5f|%-19.3f|\n", arType[i], arVes[i], arCha[i], arKol[i]);

		}

		cout << "|---------------------|--------------------------------------|----------|-------------------|\n";
	   printf_s("| Общая протяженность |%-38.2f|          |                   |\n", SrSumVes);
		cout << "|---------------------|--------------------------------------|----------|-------------------|\n";
	   printf_s("|    Среднее время    |                                      |          |%-19.3f|\n", SrSumKol);
		cout << "---------------------------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	10	ДЕСЯТЫЙ ВАРИАНТ		//-----------------------------------------------------------------//

	if (a == 10) {
		cout << "Вы выбрали 10 вариант ВРЕМЯ ВЫПОЛНЕНИЯ НЕКОТОРЫХ ПРОГРАММ, КОТОРЫЕ ПРИМЕНЯЮТ ПАРАЛЛЕЛЬНЫЕ АЛГОРИТМЫ\n\n";
		cout << "Введите кол-во программ: ";

		int sizeC;
		int SumKol = 0;
		float SumSec = 0;
		float SrSumSec = 0;
		cin >> sizeC;
		cout << endl;

		cout << "Примечание: O-OCEAN, D-DYFESM, T-TRFD\n";
		char* arNam = new char[sizeC] {};
		int* arKol = new int[sizeC] {};
		float* arCallenge = new float[sizeC] {};
		float* arIndy = new float[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите название " << i + 1 << " программы: "; cin >> arNam[i];
			cout << "\nВведите количество строк кода в " << i + 1 << " программе: "; cin >> arKol[i];
			cout << "\nВведите время исп. SGI Callange (сек) " << i + 1 << " программы: "; cin >> arCallenge[i];
			cout << "\nВведите время исп. на SGI Indy (сек) " << i + 1 << " программы: "; cin >> arIndy[i]; cout << endl << endl;

			SumSec += arCallenge[i] + arIndy[i];
			SumKol += arKol[i];
		}

		SrSumSec = SumSec / sizeC;

		cout << "--------------------------------------------------------------------------------------------------------\n";
		cout << "|Время выполнения некоторых программ, которые применяют параллельные алгоритмы                         |\n";
		cout << "|------------------------------------------------------------------------------------------------------|\n";
		cout << "| Название программы | Кол-во строк кода |Время исп. на SGI Callenge (сек)|Время исп. на SGI Indy (сек)|\n";
		cout << "|--------------------|-------------------|--------------------------------|----------------------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-20c|%-19d|%-32.2f|%-28.2f|\n", arNam[i], arKol[i], arCallenge[i], arIndy[i]);

		}

		cout << "|--------------------|-------------------|--------------------------------|----------------------------|\n";
		printf_s("|Об. кол-воСтрокКода|%-20d|                                |                            |\n", SumKol);
		cout << "|--------------------|-------------------|--------------------------------|----------------------------|\n";
		printf_s("| Об. ср. время исп. |                   |%-61.2f|\n", SrSumSec);
		cout << "|------------------------------------------------------------------------------------------------------|\n";
		cout << "|Примечание: O-OCEAN, D-DYFESM, T-TRFD                                                                 |\n";
		cout << "--------------------------------------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	11	ОДИНАДЦАТЫЙ ВАРИАНТ		//-------------------------------------------------------------//

	if (a == 11) {
		cout << "Вы выбрали 11 вариант КОЭФФИЦИЕНТЫ ТЕПЛОПРОВОДИМОСТИ МАТЕРИАЛОВ\n\n";
		cout << "Введите кол-во материалов: ";

		int sizeC;
		float SumVla = 0;
		float SumKoef = 0;
		float SrSumVla = 0;
		float SrSumKoef = 0;

		cin >> sizeC;
		cout << endl;

		cout << "Примечание (вещество): A-Алюминий, G-Стекловата, C-Глина, F-Железо, S-Пенопласт.\n";
		char* arVva = new char[sizeC] {};
		cout << "Примечание (тип): M-Металлы, T-Термоизолиоционные материалы, O-Другие материалы.\n";
		char* arType = new char[sizeC] {};
		float* arVla = new float[sizeC] {};
		float* arKoef = new float[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите вещество из которого состоит " << i + 1 << " материал: "; cin >> arVva[i];
			cout << "\nВведите тип " << i + 1 << " материала: "; cin >> arType[i];
			cout << "\nВведите влажность (%) " << i + 1 << " материала: "; cin >> arVla[i];
			cout << "\nВведите коэфициент " << i + 1 << " материала: "; cin >> arKoef[i]; cout << endl << endl;

			SumVla += arVla[i];
			SumKoef += arKoef[i];
		}

		SrSumVla = SumVla / sizeC;
		SrSumKoef = SumKoef / sizeC;

		cout << "-----------------------------------------------------------------\n";
		cout << "|Коэффициенты теплопроводимости материалов                      |\n";
		cout << "|---------------------------------------------------------------|\n";
		cout << "|   Вещество    |      Тип      | Влажность (%) |  Коэффициент  |\n";
		cout << "|---------------|---------------|---------------|---------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-15c|%-15c|%-15.1f|%-15.3f|\n", arVva[i], arType[i], arVla[i], arKoef[i]);

		}

		cout << "|---------------|---------------|---------------|---------------|\n";
	   printf_s("| Ср. влажность |               |%-15.1f|               |\n", SrSumVla);
		cout << "|---------------|---------------|---------------|---------------|\n";
	   printf_s("|Ср. коэффициент|               |               |%-15.3f|\n", SrSumKoef);
		cout << "|---------------------------------------------------------------|\n";
		cout << "|Примечание: A-Алюминий, G-Стекловата, C-Глина, F-Железо,       |\n";
		cout << "|                                                   S-Пенопласт.|\n";
		cout << "|Примечание: M-Металлы, T-Термоизолиоционные материалы,         |\n";
		cout << "|                                            O-Другие материалы.|\n";
		cout << "-----------------------------------------------------------------\n";
	}

	//--------------------------------------------//	12	ДВЕНАДЦАТЫЙ ВАРИАНТ		//-------------------------------------------------------------//

	if (a == 12) {
		cout << "Вы выбрали 12 вариант СЕЛЬСКОХОЗЯЙСТВЕННЫЕ КУЛЬТУРЫ\n\n";
		cout << "Введите видов культур: ";

		int sizeC;
		int SumPlo = 0;
		float SumYro = 0;
		float SrSumYro = 0;

		cin >> sizeC;
		cout << endl;

		cout << "Примечание (культура): S-Соя, P-Чумиза, R-Рис, G-Горох, F-Фасоль.\n";
		char* arKul = new char[sizeC] {};
		cout << "Примечание (тип): C-зерновые, B-бобовые.\n";
		char* arType = new char[sizeC] {};
		int* arPlo = new int[sizeC] {};
		float* arYro = new float[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите " << i + 1 << " культуры: "; cin >> arKul[i];
			cout << "\nВведите тип " << i + 1 << " культуры: "; cin >> arType[i];
			cout << "\nВведите посевная площадь (га) " << i + 1 << " культуры: "; cin >> arPlo[i];
			cout << "\nВведите урожайность (ц/га) " << i + 1 << " культуры: "; cin >> arYro[i]; cout << endl << endl;

			SumPlo += arPlo[i];
			SumYro += arYro[i];
		}

		SrSumYro = SumYro / sizeC;

		cout << "---------------------------------------------------------------------\n";
		cout << "|Сельскохозяйственные культуры                                      |\n";
		cout << "|-------------------------------------------------------------------|\n";
		cout << "|  Культура  |   Тип   | Посевная площадь (га) | Урожайность (ц/га) |\n";
		cout << "|------------|---------|-----------------------|--------------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-12c|%-9c|%-23d|%-20.1f|\n", arKul[i], arType[i], arPlo[i], arYro[i]);

		}

		cout << "|------------|---------|-----------------------|--------------------|\n";
	   printf_s("|Об. площадь |         |%-23d|                    |\n", SumPlo);
		cout << "|------------|---------|-----------------------|--------------------|\n";
	   printf_s("|Ср. урожайн.|         |                       |%-20.1f|\n", SrSumYro);
		cout << "|-------------------------------------------------------------------|\n";
		cout << "|Примечание (культура): S-Соя, P-Чумиза, R-Рис, G-Горох, F-Фасоль.  |\n";
		cout << "|Примечание (тип): C-зерновые, B-бобовые.                           |\n";
		cout << "---------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	13	ТРИНАДЦАТЫЙ ВАРИАНТ		//-------------------------------------------------------------//

	if (a == 13) {
		cout << "Вы выбрали 13 вариант ВЕДОМОСТИ О ПРИСВОЕННИИ КВАЛИФИКАЦИИ\n\n";
		cout << "Введите кол-во квалифицированых: ";

		int sizeC;
		float SumEkz = 0;
		int SumLvl = 0;
		float SrSumEkz = 0;
		float SrSumLvl = 0;

		cin >> sizeC;
		cout << endl;

		int* arNom = new int[sizeC] {};
		int* arGod = new int[sizeC] {};
		float* arEkz = new float[sizeC] {};
		int* arLvl = new int[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите номер " << i + 1 << " человека: "; cin >> arNom[i];
			cout << "\nВведите год рождения " << i + 1 << " человека: "; cin >> arGod[i];
			cout << "\nВведите оценка рез-ов экзаменов " << i + 1 << " человека: "; cin >> arEkz[i];
			cout << "\nВведите присвоен уровень квалификации " << i + 1 << " человека: "; cin >> arLvl[i]; cout << endl << endl;

			SumEkz += arEkz[i];
			SumLvl += arLvl[i];
		}

		SrSumEkz = SumEkz / sizeC;
		SrSumLvl = SumLvl / sizeC;

		cout << "-----------------------------------------------------------------------------\n";
		cout << "|Ведомости о присвоеннии квалификации                                       |\n";
		cout << "|---------------------------------------------------------------------------|\n";
		cout << "| Номер | Год рождения | Оценка рез-ов экзаменов | Присвоен уровень квалиф. |\n";
		cout << "|-------|--------------|-------------------------|--------------------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-7d|%-14d|%-25.1f|%-26d|\n", arNom[i], arGod[i], arEkz[i], arLvl[i]);

		}

		cout << "|----------------------|-------------------------|--------------------------|\n";
	   printf_s("|    Средняя оценка    |%-25.1f|                          |\n", SrSumEkz);
		cout << "|----------------------|-------------------------|--------------------------|\n";
	   printf_s("| Средний уровень квалификации                   |%-26.1f|\n", SrSumLvl);
		cout << "|---------------------------------------------------------------------------|\n";
		cout << "|Примечание показана итоговоя оценка по результатам экзаменов по            |\n";
		cout << "|                                   теоритической и практической подготовке.|\n";
		cout << "-----------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//	14	ЧЕТЫРНАДЦАТЫЙ ВАРИАНТ	//-------------------------------------------------------------//

	if (a == 14) {
		cout << "Вы выбрали 14 вариант ЖУРНАЛ РЕГИСТРАЦИИ АВАРИИ\n\n";
		cout << "Введите кол-во аварий: ";

		int sizeC;
		float SumYbi = 0;
		int SumPro = 0;
		float SrSumPro = 0;

		cin >> sizeC;
		cout << endl;

		cout << "Примечание: P-Птицефабрика, T-Теплоцентраль, A-Автосервис\n";
		char* arKod = new char[sizeC] {};
		int* arKat = new int[sizeC] {};
		float* arYbi = new float[sizeC] {};
		int* arPro = new int[sizeC] {};

		for (int i = 0; i < sizeC; i++) {
			cout << "\nВведите код предприятия " << i + 1 << " аварии: "; cin >> arKod[i];
			cout << "\nВведите категория " << i + 1 << " аварии: "; cin >> arKat[i];
			cout << "\nВведите убытки (тыс. руб) " << i + 1 << " аварии: "; cin >> arYbi[i];
			cout << "\nВведите срок простоя (дн) " << i + 1 << " аварии: "; cin >> arPro[i]; cout << endl << endl;

			SumYbi += arYbi[i];
			SumPro += arPro[i];
		}

		SrSumPro = SumPro / sizeC;

		cout << "----------------------------------------------------------------------------------\n";
		cout << "|Журнал регистрации аварии                                                       |\n";
		cout << "|--------------------------------------------------------------------------------|\n";
		cout << "| Код предприятия | Категория | Убытки от аварии (тыс. руб) | Срок поставки (дн) |\n";
		cout << "|-----------------|-----------|-----------------------------|--------------------|\n";

		for (int i = 0; i < sizeC; i++) {
			printf_s("|%-17c|%-11d|%-29.2f|%-20d|\n", arKod[i], arKat[i], arYbi[i], arPro[i]);

		}

		cout << "|-----------------------------|-----------------------------|--------------------|\n";
	   printf_s("|        Общие убытки         |%-29.2f|                    |\n", SumYbi);
		cout << "|-----------------------------------------------------------|--------------------|\n";
	   printf_s("|              Средний срок простоя                         |%-20.1f|\n", SrSumPro);
		cout << "|--------------------------------------------------------------------------------|\n";
		cout << "| Примечание P-Птицефабрика, T-Теплоцентраль, A-Автосервис                       |\n";
		cout << "----------------------------------------------------------------------------------\n";
	}

	//--------------------------------------------//		ОШИБКА    ВВОДА			//-------------------------------------------------------------//

	if ((a <= 0) || (a >= 15)) {
		cout << "Вы ввели неправильный номер лабораторной работы\nВведите сновa\n" << endl;
		goto repit;
	}

}
